In [1]:
import pandas as pd

In [2]:
# reading the csv file
df_exams = pd.read_csv('StudentsPerformance.csv')

In [3]:
# showing the dataframe
df_exams.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [ ]:
# I can see it has 8 attributes, namely, gender, race, parental level of education, ..., writing score. And 1000 observations
# The first five features are categorical type variables and the last three are numerical variables.

## Attributes

An attribute is a value associated with an object. (referenced by name using dotted expressions. For example, with the command:

    df.columns

we access to the 'columns' attribute of the dataframe. It is a column vector where each component corresponds to the value that\
an observation has of this attribute

In [5]:
# getting acces to the shape attribute
df_exams.shape

(1000, 8)

In [6]:
# the first is the name of the rows and the second is the number of columns

In [7]:
# getting access to the index attribute
df_exams.index

RangeIndex(start=0, stop=1000, step=1)

In [11]:
# getting access to the column attribute
df_exams.columns

Index(['gender', 'race/ethnicity', 'parental level of education', 'lunch',
       'test preparation course', 'math score', 'reading score',
       'writing score'],
      dtype='object')

In [ ]:
# And I can see here i got the name of the columns

In [12]:
# data types of each column
df_exams.dtypes

gender                         object
race/ethnicity                 object
parental level of education    object
lunch                          object
test preparation course        object
math score                      int64
reading score                   int64
writing score                   int64
dtype: object

## Methods

A method is a function which is defined inside a class body. It is a function that is associated with an object. For example:

    df.head()

In [13]:
# showing the information of the dataframe
df_exams.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

In [14]:
# So here we have some information about this dataframe. And here we have again the data type
# and also how many rows are non null for each column. As we se here, all the data in the df ar non-null
# there isn't any missing value here.

In [15]:
# describing basic statistics of the dataframe
df_exams.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [17]:
# And we have some basic statistics of the numerical features. First we have the count, this indicates 
# how many rows each column has. each of them has 1000 rows. Then the mean which is the average, the sum
# of all the values in the column divided by 1000. The standard deviation that indicates the variability
# how much the data spread/deviates from the mean value. The minimum value, the max value, the first quartil.
# For example, 25% of the students have a math score <= 57, 50% has a math score below than 66, and so on.

## Functions

A function is a group of related statements that performs a specific task. For example, some Python's built in\
functions are:

* max(), it gets the maximum element of a list
* min(), it gets the minimum element of a list
* len(), it gets the lenght of a list

In [19]:
# obtaining the length of the dataframe (number of rows)
len(df_exams)

1000

In [ ]:
# the length of the df is 1000.

In [27]:
# obtaining the highest math score of the dataframe
max(df_exams['math score'])

100

In [28]:
max(df_exams['reading score'])

100

In [29]:
max(df_exams['writing score'])

100

In [30]:
# obtaining the lowest math score of the dataframe
min(df_exams['math score'])

0

In [31]:
# obtaining the data type
type(df_exams)

pandas.core.frame.DataFrame

In [ ]:
# rounding the values of the dataset
round(df_exams, 2)
# if the df has float values we can round them and truncate the decimal part to any number of digits we want.
# the 2nd argument is the number of decimal points we want to have.